collection/collection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-16 周二 11:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />




</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3777e48">1. ARM</a>
<ul>
<li><a href="#org8d5f473">1.1. assemble</a>
<ul>
<li><a href="#org3879835">1.1.1. data copy continuous</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb17f271">2. design</a>
<ul>
<li><a href="#org7c8b729">2.1. verilog</a>
<ul>
<li><a href="#orge7c9e81">2.1.1. register&#xa0;&#xa0;&#xa0;<span class="tag"><span class="register">register</span></span></a></li>
<li><a href="#orgf6ce92c">2.1.2. Usage of define value.</a></li>
<li><a href="#org1e97e5b">2.1.3. operator priority&#xa0;&#xa0;&#xa0;<span class="tag"><span class="priority">priority</span>&#xa0;<span class="oprerator">oprerator</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9905f1a">3. verification</a>
<ul>
<li><a href="#org80fa128">3.1. system verilog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SV">SV</span></span></a>
<ul>
<li><a href="#org725c591">3.1.1. include V.S. filelist</a></li>
<li><a href="#org3c2d737">3.1.2. UVM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="UVM">UVM</span></span></a></li>
<li><a href="#org044ebf9">3.1.3. Task &amp; function port value not changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="not">not</span>&#xa0;<span class="pass">pass</span>&#xa0;<span class="port">port</span>&#xa0;<span class="Function">Function</span>&#xa0;<span class="Task">Task</span></span></a></li>
<li><a href="#orgacf3eb9">3.1.4. Use macro as string.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="String">String</span>&#xa0;<span class="Macro">Macro</span></span></a></li>
<li><a href="#orgdd723dc">3.1.5. critical signal control should be inside interface. Do not control clk in class with virtual interface.</a></li>
<li><a href="#org08b2d6b">3.1.6. Do not use <b>define</b> in test-bench&#xa0;&#xa0;&#xa0;<span class="tag"><span class="testbench">testbench</span>&#xa0;<span class="Macro">Macro</span>&#xa0;<span class="define">define</span></span></a></li>
<li><a href="#org1711452">3.1.7. predefined macro in system verilog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FILE">FILE</span>&#xa0;<span class="LINE">LINE</span></span></a></li>
</ul>
</li>
<li><a href="#orged29ac8">3.2. simulation directory structure</a>
<ul>
<li><a href="#org24c17ff">3.2.1. tree</a></li>
<li><a href="#orgb44f103">3.2.2. makefile1</a></li>
</ul>
</li>
<li><a href="#org3eb85f3">3.3. FSDB division</a>
<ul>
<li><a href="#orgd0ef512">3.3.1. By size</a></li>
<li><a href="#org9612714">3.3.2. by time</a></li>
</ul>
</li>
<li><a href="#orgb74ab9c">3.4. AMS</a>
<ul>
<li><a href="#orgfd6034f">3.4.1. verilog-ams</a></li>
<li><a href="#org9ebcb31">3.4.2. mix signals</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd47e191">4. emacs</a>
<ul>
<li><a href="#org8382674">4.1. \n \t \m</a></li>
<li><a href="#org4a18f3a">4.2. REGEX</a></li>
<li><a href="#orgba02cf3">4.3. gtags</a></li>
</ul>
</li>
<li><a href="#orgdb0517f">5. shell</a>
<ul>
<li><a href="#org8d9b9c6">5.1. value test in cshell</a></li>
<li><a href="#org12b3400">5.2. multi-thread</a>
<ul>
<li><a href="#org88536f6">5.2.1. xargs</a></li>
<li><a href="#org20b007c">5.2.2. gnu parallel</a></li>
<li><a href="#org8aac712">5.2.3. shell script</a></li>
</ul>
</li>
<li><a href="#orgccda3ad">5.3. timestamp</a></li>
<li><a href="#orgaf229a0">5.4. valuable export</a></li>
<li><a href="#orge32a64e">5.5. LSF</a></li>
<li><a href="#orgd21f349">5.6. sed</a></li>
<li><a href="#org68c6abd">5.7. xargs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bash">bash</span>&#xa0;<span class="argument">argument</span>&#xa0;<span class="Function">Function</span></span></a></li>
</ul>
</li>
<li><a href="#orgdbd91ae">6. vim</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3777e48" class="outline-2">
<h2 id="org3777e48"><span class="section-number-2">1</span> ARM</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8d5f473" class="outline-3">
<h3 id="org8d5f473"><span class="section-number-3">1.1</span> assemble</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3879835" class="outline-4">
<h4 id="org3879835"><span class="section-number-4">1.1.1</span> data copy continuous</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #93E0E3;">num</span> <span style="color: #F0DFAF; font-weight: bold;">EQU</span> 20<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#23450;&#20041;&#19968;&#20010;&#24120;&#37327;num&#65292;&#20540;&#20026;20</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">---------------------------------------------------------------------------------------------------</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">AREA&#20998;&#26512;&#22914;&#19979;&#65306;</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#35821;&#27861;&#26684;&#24335;&#65306;</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">AREA   &#27573;&#21517;  &#23646;&#24615;1&#65292;&#23646;&#24615;2&#65292;&#12290;&#12290;&#12290;</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">AREA&#20266;&#25351;&#20196;&#29992;&#20110;&#23450;&#20041;&#19968;&#20010;&#20195;&#30721;&#27573;&#25110;&#25968;&#25454;&#27573;&#12290;&#20854;&#20013;&#27573;&#21517;&#33509;&#20197;&#25968;&#23383;&#24320;&#22836;&#65292;&#21017;&#35813;&#27573;&#21517;&#38656;&#29992;"|"</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#25324;&#36215;&#26469;&#65292;&#22914;|1_test|;&#23646;&#24615;&#23383;&#27573;&#34920;&#31034;&#35813;&#20195;&#30721;&#27573;&#65288;&#25110;&#25968;&#25454;&#27573;&#65289; &#30340;&#30456;&#20851;&#23646;&#24615;&#65292;&#22810;&#20010;&#23646;&#24615;&#29992;&#36887;&#21495;&#20998;&#24320;&#24120;&#29992;</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#23646;&#24615;&#22914;&#19979;&#65306;</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">CODE&#23646;&#24615;&#65306;&#29992;&#20110;&#23450;&#20041;&#20195;&#30721;&#27573;&#65292;&#40664;&#35748;&#20026;READONLY</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">DATA&#23646;&#24615;&#65306;&#29992;&#20110;&#23450;&#20041;&#25968;&#25454;&#27573;&#65292;&#40664;&#35748;&#20026;READWRITE</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">READONLY&#23646;&#24615;&#65306;&#25351;&#23450;&#26412;&#27573;&#20026;&#21482;&#35835;&#65292;&#20195;&#30721;&#27573;&#40664;&#35748;&#20026;READONLY</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">READWRITE&#23646;&#24615;&#65306;&#25351;&#23450;&#26412;&#27573;&#20026;&#21487;&#35835;&#21487;&#20889;&#65292;&#25968;&#25454;&#27573;&#30340;&#40664;&#35748;&#23646;&#24615;&#20026;READWRITE</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">ALIGN&#23646;&#24615;&#65306;&#20351;&#29992;&#26041;&#24335;&#20026;ALIGN&#34920;&#36798;&#24335;&#12290;</span>

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">COMMON&#23646;&#24615;&#65306;&#35813;&#23646;&#24615;&#23450;&#20041;&#19968;&#20010;&#36890;&#29992;&#30340;&#27573;&#65292;&#19981;&#21253;&#21547;&#20219;&#20309;&#30340;&#29992;&#25143;&#20195;&#30721;&#21644;&#25968;&#25454;&#12290;&#21508;&#28304;&#25991;&#20214;&#20013;&#21516;&#21517;&#30340;COMMON&#27573;&#20849;&#20139;</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#21516;&#19968;&#27573;&#23384;&#20648;&#21333;&#20803;</span>
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">---------------------------------------------------------------------------------------------------</span>


    <span style="color: #F0DFAF; font-weight: bold;">AREA</span>    EXAMPLE2,CODE,READONLY  <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#22768;&#26126;&#19968;&#20010;&#20195;&#30721;&#27573;&#65292;&#21517;&#20026;EXAMPLE2</span>
    <span style="color: #F0DFAF; font-weight: bold;">ENTRY</span>   <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#25351;&#23450;&#31243;&#24207;&#20837;&#21475;&#28857;</span>
    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">-----------------------------------------------------------------------------------------------  </span>
    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">ENTRY:&#19968;&#20010;&#23436;&#25972;&#30340;&#27719;&#32534;&#31243;&#24207;&#20013;&#33267;&#23569;&#35201;&#26377;&#19968;&#20010;ENTRY&#65292;&#20063;&#21487;&#20197;&#26377;&#22810;&#20010;&#12290;&#24403;&#26377;&#22810;&#20010;ENTRY&#26102;&#65292;&#31243;&#24207;&#30340;&#30495;&#27491;&#20837;&#21475;&#28857;&#30001;</span>
    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#36830;&#25509;&#22120;&#25351;&#23450;&#65292;&#20294;&#22312;&#19968;&#20010;&#28304;&#25991;&#20214;&#37324;&#26368;&#22810;&#21482;&#33021;&#26377;&#19968;&#20010;ENTRY&#65292;&#20063;&#21487;&#20197;&#27809;&#26377;&#12290;</span>
    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">-----------------------------------------------------------------------------------------------</span>
<span style="color: #93E0E3;">Start</span>
    <span style="color: #F0DFAF; font-weight: bold;">LDR</span>     r0, =src            <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  r0 = pointer to source block &#25351;&#21521;&#28304;&#25805;&#20316;&#25968;&#30340;&#39318;&#22320;&#22336;*/</span>
    <span style="color: #F0DFAF; font-weight: bold;">LDR</span>     r1, =dst            <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  r1 = pointer to destination block &#25351;&#21521;&#30446;&#30340;&#25805;&#20316;&#25968;&#30340;&#39318;&#22320;&#22336;*/</span>
    <span style="color: #F0DFAF; font-weight: bold;">MOV</span>     r2, #num            <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  r2 = number of words to copy &#35201;&#25335;&#36125;&#22823;&#23567;*/</span>
    <span style="color: #F0DFAF; font-weight: bold;">MOV</span>     sp, #0x400          <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  set up stack pointer (r13) &#30830;&#23450;&#22534;&#26632;&#22320;&#22336;*/</span>

<span style="color: #93E0E3;">blockcopy</span>
    <span style="color: #F0DFAF; font-weight: bold;">MOVS</span>    r3,r2, LSR #3       <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  number of eight word multiples */</span>
    <span style="color: #F0DFAF; font-weight: bold;">BEQ</span>     copywords           <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  less than eight words to move ? */</span>
    <span style="color: #F0DFAF; font-weight: bold;">STMFD</span>   sp!, <span style="color: #DCDCCC;">{</span>r4-r11<span style="color: #DCDCCC;">}</span>       <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  save some working registers */</span>
<span style="color: #93E0E3;">octcopy</span>
    <span style="color: #F0DFAF; font-weight: bold;">LDMIA</span>   r0!, <span style="color: #DCDCCC;">{</span>r4-r11<span style="color: #DCDCCC;">}</span>       <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  load 8 words from the source */</span>
    <span style="color: #F0DFAF; font-weight: bold;">STMIA</span>   r1!, <span style="color: #DCDCCC;">{</span>r4-r11<span style="color: #DCDCCC;">}</span>       <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  and put them at the destination */</span>
    <span style="color: #F0DFAF; font-weight: bold;">SUBS</span>    r3, r3, #1          <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  decrement the counter */</span>
    <span style="color: #F0DFAF; font-weight: bold;">BNE</span>     octcopy             <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  ... copy more */</span>
    <span style="color: #F0DFAF; font-weight: bold;">LDMFD</span>   sp!, <span style="color: #DCDCCC;">{</span>r4-r11<span style="color: #DCDCCC;">}</span>       <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  don't need these now - restore originals */</span>
<span style="color: #93E0E3;">copywords</span>
    <span style="color: #F0DFAF; font-weight: bold;">ANDS</span>    r2, r2, #7          <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  number of odd words to copy */</span>
    <span style="color: #F0DFAF; font-weight: bold;">BEQ</span>     stop                <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  No words left to copy ? */</span>
<span style="color: #93E0E3;">wordcopy</span>
    <span style="color: #F0DFAF; font-weight: bold;">LDR</span>     r3, <span style="color: #DCDCCC;">[</span>r0<span style="color: #DCDCCC;">]</span>, #4        <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  a word from the source */</span>
    <span style="color: #F0DFAF; font-weight: bold;">STR</span>     r3, <span style="color: #DCDCCC;">[</span>r1<span style="color: #DCDCCC;">]</span>, #4        <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  store a word to the destination */</span>
    <span style="color: #F0DFAF; font-weight: bold;">SUBS</span>    r2, r2, #1          <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  decrement the counter */</span>
    <span style="color: #F0DFAF; font-weight: bold;">BNE</span>     wordcopy            <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*  ... copy more */</span>
<span style="color: #93E0E3;">stop</span>
    <span style="color: #F0DFAF; font-weight: bold;">B</span>       stop                <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">/*&#22312;&#27492;&#36827;&#20837;&#27515;&#24490;&#29615;*/</span>

    <span style="color: #F0DFAF; font-weight: bold;">AREA</span>    blockdata,DATA,READWRITE    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">&#22768;&#26126;&#19968;&#20010;&#25968;&#25454;&#27573;&#65292;&#21517;&#20026;blockdata</span>

<span style="color: #93E0E3;">src</span> <span style="color: #F0DFAF; font-weight: bold;">DCD</span> 1,2,3,4,5,6,7,8,1,2,3,4,5,6,7,8,1,2,3,4

<span style="color: #93E0E3;">dst</span> <span style="color: #F0DFAF; font-weight: bold;">DCD</span> 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    <span style="color: #F0DFAF; font-weight: bold;">END</span>
</pre>
</div>
</div>
</div>
</div>
</div>
