collection/collection.org
* design
** verilog
*** register                                                     :register:
**** firmware configure part of register without read first. :without:read:write:part:

Divid register into 2 parts. 
First part as regesiter value.
Second part as write enable bit.
When try to configure any-bits of the low register,
the Second part of the register must set to active respectily.
If the Second part does not set to active, the first parts won't changes.

#+BEGIN_SRC verilog
reg [15:0] value;
wire [15:0] value_we = wdata[31:16];
wire [31:0] register = {16'd0, value};
always @(posedge clock or negedge resetn)
if  (!resetn)
   value <= 16'd0;
else if (wr)
   value <= wdata[15:0] & value_we;
#+END_SRC
*** Usage of define value.
#+BEGIN_SRC verilog
`define FLASH_HEX ../../st/software/code.dua
readmemh(`"`FLASH_HEX`",CodeTmp);

#+END_SRC
*** operator priority                                  :priority:oprerator:
#+BEGIN_SRC verilog
assign a = b | c | d && e;
// equel to 
assign a = ( b | c | d ) && e;
// we want
assign a = b | c | (d && e);
#+END_SRC
**** more quote when it is neededd.
**** use oprerator for what it mean to be used
***** (|, &) bit operator
***** (||, &&) logic oprerator, expectially in conditional statement.
* verification
** SVA
*** Website                                                       :WEB:SVA:Tutorial:
[[http://www.project-veripage.com/index.php][project-veripage]]
[[https://www.design-reuse.com/articles/10907/using-systemverilog-assertions-in-rtl-code.html][Design Reuse]]
[[https://www.doulos.com/knowhow/sysverilog/tutorial/assertions/][Doulos Assertion]]
*** property and sequence can be trigger by event :TIRGER:
#+BEGIN_SRC verilog
property pro_1;
@(EN1 or EN2);
endproperty
#+END_SRC
*** Sample value is before sample event.
*** $past(signal, N).
return signal value N cycles before.
*** *not (A |=> B)* is not recommend.
The behaviour is not defined in LRM.
*** *default disable iff (RST)*
*** Cross clock domain assertion is not recommended for dificulties in debugging.
*** Add as much as 20% to simulation time. Good for earlier debugging.
*** Auxiliary code could help correct debug.
*** Assertion can be written in *generate* block.
*** formal
Assume runs all the time, while assertion runs once at a time.
*** guide line
** system verilog                                                      :SV:
*** DPI-C CPP                                          :dpi:c::CPP:
2 ways to use cpp in dpi interface.
#+BEGIN_SRC cpp
extern "C" int helloFromCpp(svLogic a) {
  // 0 is 0
  // 1 is 1
  // 2 is Z
  // 3 is X
  int a_int = a;
  cout << "(C++) a is " << a_int << endl;
  return 0;
}
#+END_SRC
#+BEGIN_SRC cpp
#ifdef __cplusplus
extern "C" {
#endif
 // code 
 // code
#ifdef __cplusplus
}
#endif
#+END_SRC
*** include V.S. filelist
Filelist is hard to maintain.
Use include can avoid path problems.
*** UVM                                                               :UVM:
**** uvm_callback

#+BEGIN_SRC verilog
class my_callback extends uvm_callback;
`uvm_object_utils(my_callback)
  virtual task cb_task(my_driver drv, my_transaction tr);
  endtask
endclass
#+END_SRC
#+BEGIN_SRC verilog
typedef uvm_callbacks #(my_driver, my_callback) my_cb_pool;
#+END_SRC
#+BEGIN_SRC verilog
class my_tc extends uvm_test;
my_callback my_cb;
function void connect_phase(uvm_phase phase);
  my_cb = my_callback::type_id::create("my_cb");
  my_cb_pool::add(env.agt.drv, my_cb);
endfunction
endclass
#+END_SRC
#+BEGIN_SRC verilog
task my_driver::run_phase();
   `uvm_do_callbacks(my_driver, my_callback,
   cb_task(this, req))
endtask
#+END_SRC
**** assign values to child component in /build_phase/ for phase excution order.
 If a component directly assigns the values of variables (including virtual interfaces)
 in its child components, it should do so in its build_phase method after creating 
 those child components.

