collection/collection.html
<div id="outline-container-orgb17f271" class="outline-2">
<h2 id="orgb17f271"><span class="section-number-2">2</span> design</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c8b729" class="outline-3">
<h3 id="org7c8b729"><span class="section-number-3">2.1</span> verilog</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orge7c9e81" class="outline-4">
<h4 id="orge7c9e81"><span class="section-number-4">2.1.1</span> register&#xa0;&#xa0;&#xa0;<span class="tag"><span class="register">register</span></span></h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgdf45c5c"></a>firmware configure part of register without read first.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="without">without</span>&#xa0;<span class="read">read</span>&#xa0;<span class="write">write</span>&#xa0;<span class="part">part</span></span><br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Divid register into 2 parts. 
First part as regesiter value.
Second part as write enable bit.
When try to configure any-bits of the low register,
the Second part of the register must set to active respectily.
If the Second part does not set to active, the first parts won't changes.
</p>

<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #7CB8BB;">reg</span> <span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">15</span>:<span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">]</span> value;
<span style="color: #7CB8BB;">wire</span> <span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">15</span>:<span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">]</span> value_we = wdata<span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">31</span>:<span style="color: #BFEBBF;">16</span><span style="color: #DCDCCC;">]</span>;
<span style="color: #7CB8BB;">wire</span> <span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">31</span>:<span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">]</span> register = <span style="color: #DCDCCC;">{</span><span style="color: #BFEBBF;">16</span>'d0, value<span style="color: #DCDCCC;">}</span>;
<span style="color: #F0DFAF; font-weight: bold;">always</span> <span style="color: #7CB8BB;">@</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">posedge</span> clock <span style="color: #7CB8BB;">or</span> <span style="color: #F0DFAF; font-weight: bold;">negedge</span> resetn<span style="color: #DCDCCC;">)</span>
<span style="color: #F0DFAF; font-weight: bold;">if</span>  <span style="color: #DCDCCC;">(</span>!resetn<span style="color: #DCDCCC;">)</span>
   value &lt;= <span style="color: #BFEBBF;">16</span>'d0;
<span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span>wr<span style="color: #DCDCCC;">)</span>
   value &lt;= wdata<span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">15</span>:<span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">]</span> &amp; value_we;
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf6ce92c" class="outline-4">
<h4 id="orgf6ce92c"><span class="section-number-4">2.1.2</span> Usage of define value.</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #94BFF3;">`define</span> FLASH_HEX ../../st/software/code.dua
<span style="color: #93E0E3;">readmemh</span><span style="color: #DCDCCC;">(</span>`<span style="color: #CC9393;">"`FLASH_HEX`"</span>,CodeTmp<span style="color: #DCDCCC;">)</span>;

</pre>
</div>
</div>
</div>
<div id="outline-container-org1e97e5b" class="outline-4">
<h4 id="org1e97e5b"><span class="section-number-4">2.1.3</span> operator priority&#xa0;&#xa0;&#xa0;<span class="tag"><span class="priority">priority</span>&#xa0;<span class="oprerator">oprerator</span></span></h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">assign</span> a = b | c | d &amp;&amp; e;
<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">equel to </span>
<span style="color: #F0DFAF; font-weight: bold;">assign</span> a = <span style="color: #DCDCCC;">(</span> b | c | d <span style="color: #DCDCCC;">)</span> &amp;&amp; e;
<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">we want</span>
<span style="color: #F0DFAF; font-weight: bold;">assign</span> a = b | c | <span style="color: #DCDCCC;">(</span>d &amp;&amp; e<span style="color: #DCDCCC;">)</span>;
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orge199200"></a>more quote when it is neededd.<br /></li>
<li><a id="org47b33cd"></a>use oprerator for what it mean to be used<br />
<ol class="org-ol">
<li><a id="orgfb796a9"></a>(|, &amp;) bit operator<br /></li>
<li><a id="org66a4bff"></a>(||, &amp;&amp;) logic oprerator, expectially in conditional statement.<br /></li>
</ol>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9905f1a" class="outline-2">
<h2 id="org9905f1a"><span class="section-number-2">3</span> verification</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org80fa128" class="outline-3">
<h3 id="org80fa128"><span class="section-number-3">3.1</span> system verilog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SV">SV</span></span></h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org725c591" class="outline-4">
<h4 id="org725c591"><span class="section-number-4">3.1.1</span> include V.S. filelist</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Filelist is hard to maintain.
Use include can avoid path problems.
</p>
</div>
</div>
<div id="outline-container-org3c2d737" class="outline-4">
<h4 id="org3c2d737"><span class="section-number-4">3.1.2</span> UVM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="UVM">UVM</span></span></h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="org1b7b510"></a>uvm_callback<br />
<div class="outline-text-5" id="text-3-1-2-1">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> my_callback <span style="color: #ffa500; font-weight: bold;">extends</span> uvm_callback;
<span style="color: #94BFF3;">`uvm_object_utils</span><span style="color: #DCDCCC;">(</span>my_callback<span style="color: #DCDCCC;">)</span>
  <span style="color: #ffa500; font-weight: bold;">virtual</span> <span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">cb_task</span><span style="color: #DCDCCC;">(</span>my_driver drv, my_transaction tr<span style="color: #DCDCCC;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">endtask</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #7CB8BB;">typedef</span> uvm_callbacks<span style="color: #7CB8BB;"> #</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">my_driver, my_callback</span><span style="color: #DCDCCC;">)</span> my_cb_pool;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> my_tc <span style="color: #ffa500; font-weight: bold;">extends</span> uvm_test;
my_callback my_cb;
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">void</span> <span style="color: #93E0E3;">connect_phase</span><span style="color: #DCDCCC;">(</span>uvm_phase phase<span style="color: #DCDCCC;">)</span>;
  my_cb = my_callback::type_id::<span style="color: #93E0E3;">create</span><span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"my_cb"</span><span style="color: #DCDCCC;">)</span>;
  my_cb_pool::<span style="color: #93E0E3;">add</span><span style="color: #DCDCCC;">(</span>env.agt.drv, my_cb<span style="color: #DCDCCC;">)</span>;
<span style="color: #F0DFAF; font-weight: bold;">endfunction</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">task</span> my_driver::<span style="color: #93E0E3;">run_phase</span><span style="color: #DCDCCC;">()</span>;
   <span style="color: #94BFF3;">`uvm_do_callbacks</span><span style="color: #DCDCCC;">(</span>my_driver, my_callback,
   <span style="color: #93E0E3;">cb_task</span><span style="color: #BFEBBF;">(</span><span style="color: #ffa500; font-weight: bold;">this</span>, req<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #F0DFAF; font-weight: bold;">endtask</span>
</pre>
</div>
</div>
</li>
<li><a id="org5819572"></a>assign values to child component in <i>build_phase</i> for phase excution order.<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
If a component directly assigns the values of variables (including virtual interfaces)
in its child components, it should do so in its build_phase method after creating 
those child components.
</p>
</div>
</li>
