collection/collection.org
**** Getting p_sequencer of sequence.
#+BEGIN_SRC verilog
class my_sequence extends uvm_sequence #(my_tx);
  `uvm_object_utils(my_sequence)
  `uvm_declare_p_sequencer(the_sequencer_class_name)
  ...
  
  task pre_start;
    // Get the configuration object associated with the sequencer component
    // on which this sequence is currently running
    uvm_config_db #(my_config)::get(p_sequencer, "",  "config", m_config);
  endtask

  task body;
    // Set the arbitration algorithm of the current sequencer
    p_sequencer.set_arbitration(SEQ_ARB_STRICT_RANDOM);
    begin
      sequence2 seq2;
      seq2 = sequence2::type_id::create("seq2");
      seq2.set_item_context(this, p_sequencer);
      if ( !seq2.randomize() )
        `uvm_error(get_type_name(), "Randomize failed")
      // Start a child sequence on the current sequencer
      seq2.start(p_sequencer, this);
    ...
  endtask
endclass
#+END_SRC
**** Do not use wildcard import at compilation unit scope.
That is, do not write import declarations such as /import my_package::*;/
outside of any module or package, because doing so would make any imported
names visible across all modules and packages in the file, thus defeating 
the purpose of using packages to restrict the scope of names. This advice 
applies to all import declarations at compilation unit scope, not just 
wildcard imports, but wildcard imports are the most damaging.
**** backdoor access through hierachy
***** uvm routine
#+BEGIN_SRC verilog
import "DPI-C" function int uvm_hdl_check_path(	string 	path	)
import "DPI-C" function int uvm_hdl_deposit(	string 	path, uvm_hdl_data_t 	value	)
import "DPI-C" function int uvm_hdl_force(	string 	path, uvm_hdl_data_t 	value	)
task uvm_hdl_force_time(	string 	path,	uvm_hdl_data_t 	value,	time 	force_time	 = 	)
import "DPI-C" function int uvm_hdl_release_and_read(string 	path,	inout 	uvm_hdl_data_t 	value)
import "DPI-C" function int uvm_hdl_release(	string 	path	)
#+END_SRC
***** disavantage
****** not working in post-simulation
****** need extra option('-debug' '-debug_accsess+all') that will slow down simulation
***** better ways is through (interface)
**** get_response()
#+BEGIN_SRC verilog
virtual task get_response(
 output RSP response, input int transaction_id = -1
)
#+END_SRC
By default, sequences must retrieve responses by calling get_response. If no
transaction_id is specified, this task will return the next response sent to this sequence.
If no response is available in the response queue, the method will block until a response
is received.


If a transaction_id is parameter is specified, the task will block until a response with that
transaction_id is received in the response queue.


The default size of the response queue is 8. The get_response method must be called
soon enough to avoid an overflow of the response queue to prevent responses from
being dropped.


If a response is dropped in the response queue, an error will be reported unless the error
reporting is disabled via set_response_queue_error_report_disabled.
**** uvm_event, uvm_event_pool, uvm_event_callback, uvm_barier, uvm_barier_pool
[[w3m:http://www.eetop.cn/blog/html/28/1561828-5940103.html]]
**** VIP, Do not modify VIP ports.
May course error.
e.g. Interface conflict.
In EFC tc07 prefetch, in reset sequence, ahb_if is reset by manual sequence(efc_ahb_in_reset).
And vip found reset action, vip reset ahb_if as well. It cause a conflict onf ahb_if. 
And transaction went wrong in later waveform.
