collection/collection.html

<li><a id="orgb1e698d"></a>Getting p_sequencer of sequence.<br />
<div class="outline-text-5" id="text-3-1-2-3">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> my_sequence <span style="color: #ffa500; font-weight: bold;">extends</span> uvm_sequence<span style="color: #7CB8BB;"> #</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">my_tx</span><span style="color: #DCDCCC;">)</span>;
  <span style="color: #94BFF3;">`uvm_object_utils</span><span style="color: #DCDCCC;">(</span>my_sequence<span style="color: #DCDCCC;">)</span>
  <span style="color: #94BFF3;">`uvm_declare_p_sequencer</span><span style="color: #DCDCCC;">(</span>the_sequencer_class_name<span style="color: #DCDCCC;">)</span>
  ...

  <span style="color: #F0DFAF; font-weight: bold;">task</span> pre_start;
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Get the configuration object associated with the sequencer component</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">on which this sequence is currently running</span>
    uvm_config_db<span style="color: #7CB8BB;"> #</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">my_config</span><span style="color: #DCDCCC;">)</span>::<span style="color: #93E0E3;">get</span><span style="color: #DCDCCC;">(</span>p_sequencer, <span style="color: #CC9393;">""</span>,  <span style="color: #CC9393;">"config"</span>, m_config<span style="color: #DCDCCC;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">endtask</span>

  <span style="color: #F0DFAF; font-weight: bold;">task</span> body;
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Set the arbitration algorithm of the current sequencer</span>
    p_sequencer.<span style="color: #93E0E3;">set_arbitration</span><span style="color: #DCDCCC;">(</span>SEQ_ARB_STRICT_RANDOM<span style="color: #DCDCCC;">)</span>;
    <span style="color: #7CB8BB;">begin</span>
      sequence2 seq2;
      seq2 = sequence2::type_id::<span style="color: #93E0E3;">create</span><span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"seq2"</span><span style="color: #DCDCCC;">)</span>;
      seq2.<span style="color: #93E0E3;">set_item_context</span><span style="color: #DCDCCC;">(</span><span style="color: #ffa500; font-weight: bold;">this</span>, p_sequencer<span style="color: #DCDCCC;">)</span>;
      <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span> !seq2.<span style="color: #93E0E3;">randomize</span><span style="color: #BFEBBF;">()</span> <span style="color: #DCDCCC;">)</span>
        <span style="color: #94BFF3;">`uvm_error</span><span style="color: #DCDCCC;">(</span><span style="color: #93E0E3;">get_type_name</span><span style="color: #BFEBBF;">()</span>, <span style="color: #CC9393;">"Randomize failed"</span><span style="color: #DCDCCC;">)</span>
      <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">Start a child sequence on the current sequencer</span>
      seq2.<span style="color: #93E0E3;">start</span><span style="color: #DCDCCC;">(</span>p_sequencer, <span style="color: #ffa500; font-weight: bold;">this</span><span style="color: #DCDCCC;">)</span>;
    ...
  <span style="color: #F0DFAF; font-weight: bold;">endtask</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>
</div>
</li>
<li><a id="org36c0ac2"></a>Do not use wildcard import at compilation unit scope.<br />
<div class="outline-text-5" id="text-3-1-2-4">
<p>
That is, do not write import declarations such as <i>import my_package::*;</i>
outside of any module or package, because doing so would make any imported
names visible across all modules and packages in the file, thus defeating 
the purpose of using packages to restrict the scope of names. This advice 
applies to all import declarations at compilation unit scope, not just 
wildcard imports, but wildcard imports are the most damaging.
</p>
</div>
</li>
<li><a id="orgaad35cd"></a>backdoor access through hierachy<br />
<ol class="org-ol">
<li><a id="org3ca4e29"></a>uvm routine<br />
<div class="outline-text-6" id="text-3-1-2-5-1">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #ffa500; font-weight: bold;">import</span> <span style="color: #CC9393;">"DPI-C"</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">int</span> <span style="color: #93E0E3;">uvm_hdl_check_path</span><span style="color: #DCDCCC;">(</span> <span style="color: #ffa500; font-weight: bold;">string</span>  path  <span style="color: #DCDCCC;">)</span>
<span style="color: #ffa500; font-weight: bold;">import</span> <span style="color: #CC9393;">"DPI-C"</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">int</span> <span style="color: #93E0E3;">uvm_hdl_deposit</span><span style="color: #DCDCCC;">(</span>  <span style="color: #ffa500; font-weight: bold;">string</span>  path, uvm_hdl_data_t  value <span style="color: #DCDCCC;">)</span>
<span style="color: #ffa500; font-weight: bold;">import</span> <span style="color: #CC9393;">"DPI-C"</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">int</span> <span style="color: #93E0E3;">uvm_hdl_force</span><span style="color: #DCDCCC;">(</span>  <span style="color: #ffa500; font-weight: bold;">string</span>  path, uvm_hdl_data_t  value <span style="color: #DCDCCC;">)</span>
<span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">uvm_hdl_force_time</span><span style="color: #DCDCCC;">(</span>  <span style="color: #ffa500; font-weight: bold;">string</span>  path, uvm_hdl_data_t  value,  <span style="color: #7CB8BB;">time</span>  force_time   =  <span style="color: #DCDCCC;">)</span>
<span style="color: #ffa500; font-weight: bold;">import</span> <span style="color: #CC9393;">"DPI-C"</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">int</span> <span style="color: #93E0E3;">uvm_hdl_release_and_read</span><span style="color: #DCDCCC;">(</span><span style="color: #ffa500; font-weight: bold;">string</span>   path, <span style="color: #7CB8BB;">inout</span>   uvm_hdl_data_t  value<span style="color: #DCDCCC;">)</span>
<span style="color: #ffa500; font-weight: bold;">import</span> <span style="color: #CC9393;">"DPI-C"</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">int</span> <span style="color: #93E0E3;">uvm_hdl_release</span><span style="color: #DCDCCC;">(</span>  <span style="color: #ffa500; font-weight: bold;">string</span>  path  <span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org510e7fb"></a>disavantage<br />
<ol class="org-ol">
<li><a id="org2ccbdd6"></a>not working in post-simulation<br /></li>
<li><a id="org37addd4"></a>need extra option('-debug' '-debug_accsess+all') that will slow down simulation<br /></li>
</ol>
</li>
<li><a id="org916d99b"></a>better ways is through (interface)<br /></li>
</ol>
</li>
<li><a id="org540089e"></a>get_response()<br />
<div class="outline-text-5" id="text-3-1-2-6">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #ffa500; font-weight: bold;">virtual</span> <span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">get_response</span><span style="color: #DCDCCC;">(</span>
 <span style="color: #7CB8BB;">output</span> RSP response, <span style="color: #7CB8BB;">input</span> <span style="color: #ffa500; font-weight: bold;">int</span> transaction_id = -<span style="color: #BFEBBF;">1</span>
<span style="color: #DCDCCC;">)</span>
</pre>
</div>
<p>
By default, sequences must retrieve responses by calling get_response. If no
transaction_id is specified, this task will return the next response sent to this sequence.
If no response is available in the response queue, the method will block until a response
is received.
</p>


<p>
If a transaction_id is parameter is specified, the task will block until a response with that
transaction_id is received in the response queue.
</p>


<p>
The default size of the response queue is 8. The get_response method must be called
soon enough to avoid an overflow of the response queue to prevent responses from
being dropped.
</p>


<p>
If a response is dropped in the response queue, an error will be reported unless the error
reporting is disabled via set_response_queue_error_report_disabled.
</p>
</div>
</li>
<li><a id="org523930e"></a>uvm_event, uvm_event_pool, uvm_event_callback, uvm_barier, uvm_barier_pool<br />
<div class="outline-text-5" id="text-3-1-2-7">
<p>
<a href="http://www.eetop.cn/blog/html/28/1561828-5940103.html">http://www.eetop.cn/blog/html/28/1561828-5940103.html</a>
</p>
</div>
</li>
<li><a id="org9b3e23e"></a>VIP, Do not modify VIP ports.<br />
<div class="outline-text-5" id="text-3-1-2-8">
<p>
May course error.
e.g. Interface conflict.
In EFC tc07 prefetch, in reset sequence, ahb_if is reset by manual sequence(efc_ahb_in_reset).
And vip found reset action, vip reset ahb_if as well. It cause a conflict onf ahb_if. 
And transaction went wrong in later waveform.
</p>
</div>
</li>
