collection/collection.org
**** Customizing UVM Message Format
[http://cluelogic.com/2011/05/customizing-uvm-message-format/]
#+BEGIN_SRC verilog
class my_report_server extends uvm_report_server;
   virtual function string compose_message( uvm_severity severity,
                                            string name,
                                            string id,
                                            string message,
                                            string filename,
                                            int line );
      uvm_severity_type severity_type = uvm_severity_type'( severity );
      return $psprintf( "%-8s | %16s | %2d | %0t | %-21s | %-7s | %s",
             severity_type.name(), filename, line, $time, name, id, message );
   endfunction: compose_message
endclass: my_report_server
#+END_SRC
#+BEGIN_SRC verilog
class my_test extends uvm_test;
   // ...
   function void start_of_simulation();
      my_report_server my_server = new;
      uvm_report_server::set_server( my_server );
   endfunction: start_of_simulation
endclass: my_test
#+END_SRC
#+BEGIN_SRC shell
# UVM_INFO my_uvm_report.sv(83) @ 0: reporter [top] This is a message from top.
# UVM_INFO | my_uvm_report.sv | 68 | 0 | uvm_test_top          | my_test | This is a message from my_test.
# UVM_INFO | my_uvm_report.sv | 39 | 0 | uvm_test_top.my_env_h | my_env  | This is a message from my_env.
#+END_SRC
#+BEGIN_SRC verilog
   function string getShortFileName(string s);
      int offset = 0;
      int lastChar;
      string shortFileName;
      int slashPosition;
      
      lastChar = s.len()-1;
      for (int i = lastChar; i >= offset; i=i-1) begin
        if (s.getc(i) inside {"/", "\\"}) begin
          slashPosition = i;
          break;
        end
      end // for loop
          
       shortFileName = s.substr(slashPosition+1, lastChar);
       return shortFileName;
    endfunction
#+END_SRC
**** randomize bug of vcs
Use config_db to sequence instead of randomize constraint.
#+BEGIN_SRC verilog
class a;
rand int a1;
function new();
endfunction
endclass

class b;
rand int a1;
int a1_tmp;
a a;
function new(;
endfunction

function test;
//not working
a.randomize() with {a1 == this.a1};

//working
a1_tmp=a1;
a.randomize() with {a1 == a1_tmp};
endfunction
endclass
#+END_SRC
**** save/restore to run different cases :define:Macro:restore:save:
***** basic
#+BEGIN_SRC verilog
  if($test$plusargs("seq")) begin
      $value$plusargs("seq=%s", seq_name); 
      $display("The value of sequence::%s", seq_name);
    end
    $cast(exec_seq, factory.create_object_by_name(seq_name));
    exec_seq.start(ubus_example_tb0.ubus0.masters[0].sequencer);
#+END_SRC
1. insert point of time want to save.
2. use $test$plusargs to check run_time option
3. cast seq to type that is wanted.
