collection/collection.html
<li><a id="orge12d81b"></a>Customizing UVM Message Format<br />
<div class="outline-text-5" id="text-3-1-2-9">
<p>
[<a href="http://cluelogic.com/2011/05/customizing-uvm-message-format/">http://cluelogic.com/2011/05/customizing-uvm-message-format/</a>]
</p>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> my_report_server <span style="color: #ffa500; font-weight: bold;">extends</span> uvm_report_server;
   <span style="color: #ffa500; font-weight: bold;">virtual</span> <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">string</span> <span style="color: #93E0E3;">compose_message</span><span style="color: #DCDCCC;">(</span> uvm_severity severity,
                                            <span style="color: #ffa500; font-weight: bold;">string</span> name,
                                            <span style="color: #ffa500; font-weight: bold;">string</span> id,
                                            <span style="color: #ffa500; font-weight: bold;">string</span> message,
                                            <span style="color: #ffa500; font-weight: bold;">string</span> filename,
                                            <span style="color: #ffa500; font-weight: bold;">int</span> line <span style="color: #DCDCCC;">)</span>;
      uvm_severity_type severity_type = uvm_severity_type'<span style="color: #DCDCCC;">(</span> severity <span style="color: #DCDCCC;">)</span>;
      <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">$psprintf</span><span style="color: #DCDCCC;">(</span> <span style="color: #CC9393;">"%-8s | %16s | %2d | %0t | %-21s | %-7s | %s"</span>,
             severity_type.<span style="color: #93E0E3;">name</span><span style="color: #BFEBBF;">()</span>, filename, line, <span style="color: #F0DFAF; font-weight: bold;">$time</span>, name, id, message <span style="color: #DCDCCC;">)</span>;
   <span style="color: #F0DFAF; font-weight: bold;">endfunction</span>: compose_message
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>: my_report_server
</pre>
</div>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> my_test <span style="color: #ffa500; font-weight: bold;">extends</span> uvm_test;
   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">...</span>
   <span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">void</span> <span style="color: #93E0E3;">start_of_simulation</span><span style="color: #DCDCCC;">()</span>;
      my_report_server my_server = <span style="color: #ffa500; font-weight: bold;">new</span>;
      uvm_report_server::<span style="color: #93E0E3;">set_server</span><span style="color: #DCDCCC;">(</span> my_server <span style="color: #DCDCCC;">)</span>;
   <span style="color: #F0DFAF; font-weight: bold;">endfunction</span>: start_of_simulation
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>: my_test
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">UVM_INFO my_uvm_report.sv(83) @ 0: reporter [top] This is a message from top.</span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">UVM_INFO | my_uvm_report.sv | 68 | 0 | uvm_test_top          | my_test | This is a message from my_test.</span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">UVM_INFO | my_uvm_report.sv | 39 | 0 | uvm_test_top.my_env_h | my_env  | This is a message from my_env.</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">string</span> <span style="color: #93E0E3;">getShortFileName</span><span style="color: #DCDCCC;">(</span><span style="color: #ffa500; font-weight: bold;">string</span> s<span style="color: #DCDCCC;">)</span>;
   <span style="color: #ffa500; font-weight: bold;">int</span> offset = <span style="color: #BFEBBF;">0</span>;
   <span style="color: #ffa500; font-weight: bold;">int</span> lastChar;
   <span style="color: #ffa500; font-weight: bold;">string</span> shortFileName;
   <span style="color: #ffa500; font-weight: bold;">int</span> slashPosition;

   lastChar = s.<span style="color: #93E0E3;">len</span><span style="color: #DCDCCC;">()</span>-<span style="color: #BFEBBF;">1</span>;
   <span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #DCDCCC;">(</span><span style="color: #ffa500; font-weight: bold;">int</span> i = lastChar; i &gt;= offset; i=i-<span style="color: #BFEBBF;">1</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">begin</span>
     <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span>s.<span style="color: #93E0E3;">getc</span><span style="color: #BFEBBF;">(</span>i<span style="color: #BFEBBF;">)</span> <span style="color: #ffa500; font-weight: bold;">inside</span> <span style="color: #BFEBBF;">{</span><span style="color: #CC9393;">"/"</span>, <span style="color: #CC9393;">"\\"</span><span style="color: #BFEBBF;">}</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">begin</span>
       slashPosition = i;
       <span style="color: #F0DFAF; font-weight: bold;">break</span>;
     <span style="color: #7CB8BB;">end</span>
   <span style="color: #7CB8BB;">end</span> <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">for loop</span>

    shortFileName = s.<span style="color: #93E0E3;">substr</span><span style="color: #DCDCCC;">(</span>slashPosition+<span style="color: #BFEBBF;">1</span>, lastChar<span style="color: #DCDCCC;">)</span>;
    <span style="color: #F0DFAF; font-weight: bold;">return</span> shortFileName;
 <span style="color: #F0DFAF; font-weight: bold;">endfunction</span>
</pre>
</div>
</div>
</li>
<li><a id="orgbd96822"></a>randomize bug of vcs<br />
<div class="outline-text-5" id="text-3-1-2-10">
<p>
Use config_db to sequence instead of randomize constraint.
</p>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> a;
<span style="color: #ffa500; font-weight: bold;">rand</span> <span style="color: #ffa500; font-weight: bold;">int</span> a1;
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">new</span><span style="color: #DCDCCC;">()</span>;
<span style="color: #F0DFAF; font-weight: bold;">endfunction</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>

<span style="color: #F0DFAF; font-weight: bold;">class</span> b;
<span style="color: #ffa500; font-weight: bold;">rand</span> <span style="color: #ffa500; font-weight: bold;">int</span> a1;
<span style="color: #ffa500; font-weight: bold;">int</span> a1_tmp;
a a;
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #ffa500; font-weight: bold;">new</span><span style="color: #DCDCCC;">(</span>;
<span style="color: #F0DFAF; font-weight: bold;">endfunction</span>

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #BFEBBF;">test</span>;
<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">not working</span>
a.<span style="color: #93E0E3;">randomize</span><span style="color: #BFEBBF;">()</span> <span style="color: #ffa500; font-weight: bold;">with</span> <span style="color: #BFEBBF;">{</span>a1 == <span style="color: #ffa500; font-weight: bold;">this</span>.a1<span style="color: #BFEBBF;">}</span>;

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">working</span>
a1_tmp=a1;
a.<span style="color: #93E0E3;">randomize</span><span style="color: #BFEBBF;">()</span> <span style="color: #ffa500; font-weight: bold;">with</span> <span style="color: #BFEBBF;">{</span>a1 == a1_tmp<span style="color: #BFEBBF;">}</span>;
<span style="color: #F0DFAF; font-weight: bold;">endfunction</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>
</div>
</li>
<li><a id="org646f23d"></a>save/restore to run different cases&#xa0;&#xa0;&#xa0;<span class="tag"><span class="define">define</span>&#xa0;<span class="Macro">Macro</span>&#xa0;<span class="restore">restore</span>&#xa0;<span class="save">save</span></span><br />
<ol class="org-ol">
<li><a id="orge9f761f"></a>basic<br />
<div class="outline-text-6" id="text-3-1-2-11-1">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">if</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">$test$plusargs</span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"seq"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">begin</span>
    <span style="color: #F0DFAF; font-weight: bold;">$value$plusargs</span><span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"seq=%s"</span>, seq_name<span style="color: #DCDCCC;">)</span>; 
    <span style="color: #F0DFAF; font-weight: bold;">$display</span><span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"The value of sequence::%s"</span>, seq_name<span style="color: #DCDCCC;">)</span>;
  <span style="color: #7CB8BB;">end</span>
  <span style="color: #F0DFAF; font-weight: bold;">$cast</span><span style="color: #DCDCCC;">(</span>exec_seq, factory.<span style="color: #93E0E3;">create_object_by_name</span><span style="color: #BFEBBF;">(</span>seq_name<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>;
  exec_seq.<span style="color: #93E0E3;">start</span><span style="color: #DCDCCC;">(</span>ubus_example_tb0.ubus0.masters<span style="color: #BFEBBF;">[</span><span style="color: #BFEBBF;">0</span><span style="color: #BFEBBF;">]</span>.sequencer<span style="color: #DCDCCC;">)</span>;
</pre>
</div>
<ol class="org-ol">
<li>insert point of time want to save.</li>
<li>use $test$plusargs to check run_time option</li>
<li>cast seq to type that is wanted.</li>
</ol>
</div>
</li>
