collection/collection.org
***** article
Run-Time Save-Restore Strategy with UVM and VCS


In many verification environments, 
you re-use the same configuration cycles across different testcases. 
These cycles might involve writing and reading from different configuration and status registers, 
loading program memories, and other similar tasks to set up a DUT for the targeted stimulus. 
In many of these environments, the time taken during these configuration cycles are very long. 
Also, there is a lot of redundancy as the verification engineers have to run the same set of 
verified configuration cycles for different testcases leading to a loss in productivity. 
This is especially true for complex verification environments with multiple interfaces which require
different components to be configured.


The Verilog language provides an option of saving the state of the design and the testbench at a 
particular point in time. You can restore the simulation to the same state and continue from there. 
This can be done by adding appropriate built-in system calls from the Verilog code. 
VCS provides the same options from the Unified Command Line Interface (UCLI).


However, it is not enough for you to restore simulation from the saved state. 
For different simulations, you may want to apply different random stimulus to the DUT. 
In the context of UVM, you would want to run different sequences from a saved state.


This article explains how to achieve the above strategy with the simple existing UBUS example 
available in the standard UVM installation. You can also refer to the attached example: [[file:ubus_save_restore.tar.gz][ubus_save_restore.tar.gz]]


Simple changes are made in the environment to show what needs to be done to bring in this additional capability. 
Within the existing set of tests, the two namely, “test_read_modify_write” and “test_r8_w8_r4_w4”, 
differ only with respect to the master sequence being executed, that is, “read_modify_write_seq” 
and “r8_w8_r4_w4_seq” respectively.



// Read Modify Write Read Test

class test_read_modify_write extends ubus_example_base_test;
   ….
  virtual function void build_phase(uvm_phase phase);
   uvm_config_db#(uvm_object_wrapper)::set(this,
                    "ubus_example_tb0.ubus0.masters[0].sequencer.main_phase",
                    "default_sequence", read_modify_write_seq::type_id::get());
   uvm_config_db#(uvm_object_wrapper)::set(this,
                    "ubus_example_tb0.ubus0.slaves[0].sequencer.main_phase",
                    "default_sequence", slave_memory_seq::type_id::get());
   endfunction : build_phase
endclass : test_read_modify_write
 

// Large word read/write test

class test_r8_w8_r4_w4 extends ubus_example_base_test;
  …
   virtual function void build_phase(uvm_phase phase);
     uvm_config_db#(uvm_object_wrapper)::set(this,
             "ubus_example_tb0.ubus0.masters[0].sequencer.main_phase",
             "default_sequence", r8_w8_r4_w4_seq::type_id::get());
     uvm_config_db#(uvm_object_wrapper)::set(this,
             "ubus_example_tb0.ubus0.slaves[0].sequencer.main_phase",
                    "default_sequence", slave_memory_seq::type_id::get());
   endfunction : build_phase
endclass : test_r8_w8_r4_w4


For example, consider that you have a scenario where you would want to save a simulation once 
the reset_phase is done and then start executing different sequences post the reset_phase the 
restored simulations. To demonstrate a similar scenario through the UBUS tests, a delay is
introduced in the reset_phase of the base test (in a real test, this may correspond to the PLL
lock, DDR Initialization, Basic DUT Configuration).

// Base Test

class ubus_example_base_test extends uvm_test;
  `uvm_component_utils(ubus_example_base_test)
  .. .
  task reset_phase(uvm_phase phase);
    `uvm_info("reset_phase", "Entering...", UVM_NONE)
    phase.raise_objection(this);
    #100;
    phase.drop_objection(this);
    `uvm_info("reset_phase", "Exiting...", UVM_NONE)
  endtask : reset_phase
endclass : ubus_example_base_test

The following snippet shows how the existing tests are modified to bring in 
the capability of running different tests in different ‘restored’ simulations:

// 1 Master – 1 Slave Test

class test_generic_1m_1s extends ubus_example_base_test;
  `uvm_component_utils(test_generic_1m_1s)
   ….
  virtual task main_phase(uvm_phase phase);
    uvm_sequence_base exec_seq;
    string seq_name;
    `uvm_info(“main_phase", "Entering...", UVM_NONE)
    phase.raise_objection(this);
    super.main_phase(phase);
    if($test$plusargs("seq")) begin
      $value$plusargs("seq=%s", seq_name); 
      $display("The value of sequence::%s", seq_name);
    end
    $cast(exec_seq, factory.create_object_by_name(seq_name));
    exec_seq.start(ubus_example_tb0.ubus0.masters[0].sequencer);
    phase.drop_objection(this);
    `uvm_info(“main_phase", "Exiting...", UVM_NONE)
  endtask
endclass : test_generic_1m_1s
 As evident in the code, two major modifications are made:

Shift the setting of the phase default_sequence from the build phase to the start of the main phase.

Get the name of the sequence as an argument from the command-line and process the string appropriately 
in the code to execute the sequence on the relevant sequencer.

As you can see, the changes are kept to a minimum. With this, the above generic framework is ready to 
be simulated.  In VCS, one of the different ways, the save/restore flow can be enabled as follows.


//Compilation

vcs -sverilog -ntb_opts uvm +incdir+../sv ubus_tb_top.sv -debug
//Simulate to a common state

./simv +UVM_TESTNAME=test_generic_1m_1s -ucli -i makerestore.in
//Simulate different stimulus

./simv +seq=read_modify_write_seq -ucli -i runrestore.in
./simv +seq=r8_w8_r4_w4_seq -ucli -i runrestore.in
 

% cat makerestore.in
run 100
## saving the state in saveddesign after 100 timeunits
save saveddesign
quit
% cat runrestore.in
## Restoring saved design
restore saveddesign
## simulation proceeds after 100 time units
run
Thus, the above strategy helps in optimal utilization of the compute resources with simple changes 
in your verification flow. Hope this was useful and you manage to easily make the changes in your 
verification environment to adopt this flow and avoid redundant simulation cycles.

*** Task & function port value not changes      :not:pass:port:Function:Task:
#+BEGIN_SRC verilog
task pulse_gen(ref logic en, ref logic pulse);
    forever begin
        @pulse_e;
        pulse = 1'b1;
        repeat (2) @(posedge clk_if.ClkSrc);
        pulse = 1'b0;
    end
endtask
#+END_SRC

