collection/collection.html
<li><a id="orgd00543c"></a>article<br />
<div class="outline-text-6" id="text-3-1-2-11-2">
<p>
Run-Time Save-Restore Strategy with UVM and VCS
</p>


<p>
In many verification environments, 
you re-use the same configuration cycles across different testcases. 
These cycles might involve writing and reading from different configuration and status registers, 
loading program memories, and other similar tasks to set up a DUT for the targeted stimulus. 
In many of these environments, the time taken during these configuration cycles are very long. 
Also, there is a lot of redundancy as the verification engineers have to run the same set of 
verified configuration cycles for different testcases leading to a loss in productivity. 
This is especially true for complex verification environments with multiple interfaces which require
different components to be configured.
</p>


<p>
The Verilog language provides an option of saving the state of the design and the testbench at a 
particular point in time. You can restore the simulation to the same state and continue from there. 
This can be done by adding appropriate built-in system calls from the Verilog code. 
VCS provides the same options from the Unified Command Line Interface (UCLI).
</p>


<p>
However, it is not enough for you to restore simulation from the saved state. 
For different simulations, you may want to apply different random stimulus to the DUT. 
In the context of UVM, you would want to run different sequences from a saved state.
</p>


<p>
This article explains how to achieve the above strategy with the simple existing UBUS example 
available in the standard UVM installation. You can also refer to the attached example: <a href="ubus_save_restore.tar.gz">ubus_save_restore.tar.gz</a>
</p>


<p>
Simple changes are made in the environment to show what needs to be done to bring in this additional capability. 
Within the existing set of tests, the two namely, “test_read_modify_write” and “test_r8_w8_r4_w4”, 
differ only with respect to the master sequence being executed, that is, “read_modify_write_seq” 
and “r8_w8_r4_w4_seq” respectively.
</p>



<p>
// Read Modify Write Read Test
</p>

<p>
class test_read_modify_write extends ubus_example_base_test;
   ….
  virtual function void build_phase(uvm_phase phase);
   uvm_config_db#(uvm_object_wrapper)::set(this,
                    "ubus_example_tb0.ubus0.masters[0].sequencer.main_phase",
                    "default_sequence", read_modify_write_seq::type_id::get());
   uvm_config_db#(uvm_object_wrapper)::set(this,
                    "ubus_example_tb0.ubus0.slaves[0].sequencer.main_phase",
                    "default_sequence", slave_memory_seq::type_id::get());
   endfunction : build_phase
endclass : test_read_modify_write
</p>


<p>
// Large word read/write test
</p>

<p>
class test_r8_w8_r4_w4 extends ubus_example_base_test;
  …
   virtual function void build_phase(uvm_phase phase);
     uvm_config_db#(uvm_object_wrapper)::set(this,
             "ubus_example_tb0.ubus0.masters[0].sequencer.main_phase",
             "default_sequence", r8_w8_r4_w4_seq::type_id::get());
     uvm_config_db#(uvm_object_wrapper)::set(this,
             "ubus_example_tb0.ubus0.slaves[0].sequencer.main_phase",
                    "default_sequence", slave_memory_seq::type_id::get());
   endfunction : build_phase
endclass : test_r8_w8_r4_w4
</p>


<p>
For example, consider that you have a scenario where you would want to save a simulation once 
the reset_phase is done and then start executing different sequences post the reset_phase the 
restored simulations. To demonstrate a similar scenario through the UBUS tests, a delay is
introduced in the reset_phase of the base test (in a real test, this may correspond to the PLL
lock, DDR Initialization, Basic DUT Configuration).
</p>

<p>
// Base Test
</p>

<p>
class ubus_example_base_test extends uvm_test;
  `uvm_component_utils(ubus_example_base_test)
  .. .
  task reset_phase(uvm_phase phase);
    `uvm_info("reset_phase", "Entering&#x2026;", UVM_NONE)
    phase.raise_objection(this);
    #100;
    phase.drop_objection(this);
    `uvm_info("reset_phase", "Exiting&#x2026;", UVM_NONE)
  endtask : reset_phase
endclass : ubus_example_base_test
</p>

<p>
The following snippet shows how the existing tests are modified to bring in 
the capability of running different tests in different ‘restored’ simulations:
</p>

<p>
// 1 Master – 1 Slave Test
</p>

<p>
class test_generic_1m_1s extends ubus_example_base_test;
  `uvm_component_utils(test_generic_1m_1s)
   ….
  virtual task main_phase(uvm_phase phase);
    uvm_sequence_base exec_seq;
    string seq_name;
    `uvm_info(“main_phase", "Entering&#x2026;", UVM_NONE)
    phase.raise_objection(this);
    super.main_phase(phase);
    if($test$plusargs("seq")) begin
      $value$plusargs("seq=%s", seq_name); 
      $display("The value of sequence::%s", seq_name);
    end
    $cast(exec_seq, factory.create_object_by_name(seq_name));
    exec_seq.start(ubus_example_tb0.ubus0.masters[0].sequencer);
    phase.drop_objection(this);
    `uvm_info(“main_phase", "Exiting&#x2026;", UVM_NONE)
  endtask
endclass : test_generic_1m_1s
 As evident in the code, two major modifications are made:
</p>

<p>
Shift the setting of the phase default_sequence from the build phase to the start of the main phase.
</p>

<p>
Get the name of the sequence as an argument from the command-line and process the string appropriately 
in the code to execute the sequence on the relevant sequencer.
</p>

<p>
As you can see, the changes are kept to a minimum. With this, the above generic framework is ready to 
be simulated.  In VCS, one of the different ways, the save/restore flow can be enabled as follows.
</p>


<p>
//Compilation
</p>

<p>
vcs -sverilog -ntb_opts uvm <del>incdir</del>../sv ubus_tb_top.sv -debug
//Simulate to a common state
</p>

<p>
./simv +UVM_TESTNAME=test_generic_1m_1s -ucli -i makerestore.in
//Simulate different stimulus
</p>

<p>
./simv +seq=read_modify_write_seq -ucli -i runrestore.in
./simv +seq=r8_w8_r4_w4_seq -ucli -i runrestore.in
</p>


<p>
% cat makerestore.in
run 100
## saving the state in saveddesign after 100 timeunits
save saveddesign
quit
% cat runrestore.in
## Restoring saved design
restore saveddesign
## simulation proceeds after 100 time units
run
Thus, the above strategy helps in optimal utilization of the compute resources with simple changes 
in your verification flow. Hope this was useful and you manage to easily make the changes in your 
verification environment to adopt this flow and avoid redundant simulation cycles.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org044ebf9" class="outline-4">
<h4 id="org044ebf9"><span class="section-number-4">3.1.3</span> Task &amp; function port value not changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="not">not</span>&#xa0;<span class="pass">pass</span>&#xa0;<span class="port">port</span>&#xa0;<span class="Function">Function</span>&#xa0;<span class="Task">Task</span></span></h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">pulse_gen</span><span style="color: #DCDCCC;">(</span><span style="color: #ffa500; font-weight: bold;">ref</span> <span style="color: #7CB8BB;">logic</span> en, <span style="color: #ffa500; font-weight: bold;">ref</span> <span style="color: #7CB8BB;">logic</span> pulse<span style="color: #DCDCCC;">)</span>;
    <span style="color: #F0DFAF; font-weight: bold;">forever</span> <span style="color: #7CB8BB;">begin</span>
        <span style="color: #7CB8BB;">@</span>pulse_e;
        pulse = <span style="color: #BFEBBF;">1</span>'b1;
        <span style="color: #F0DFAF; font-weight: bold;">repeat</span> <span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">2</span><span style="color: #DCDCCC;">)</span> <span style="color: #7CB8BB;">@</span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">posedge</span> clk_if.ClkSrc<span style="color: #DCDCCC;">)</span>;
        pulse = <span style="color: #BFEBBF;">1</span>'b0;
    <span style="color: #7CB8BB;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">endtask</span>
</pre>
</div>
</div>
</div>
