collection/collection.org
*** Use macro as string.                                     :String:Macro:
#+BEGIN_SRC verilog
`define FLASh_HEX  ../../st/software/code.dua
#` $readmemh(`"`FLASH_HEX`",CodeTmp);
#+END_SRC
*** Use macro as with /include/ .                            :String:Macro:include:
#+BEGIN_SRC verilog
`define TMP_DIR ../
`define TMP_FILE1 `"`TMP_DIR/tmp1.sv`"
`define TMP_FILE2 `"`TMP_DIR/tmp2.sv`"
`include `TMP_FILE1
`include `TMP_FILE2
#+END_SRC
*** critical signal control should be inside interface. Do not control clk in class with virtual interface.
Clock edge may not be sample correctly for register. Recommanded clock is in inside /module/.

False example
#+BEGIN_SRC verilog
class clk_ctrl;
   task clk_t(time delay);
      forever #delay vif.clk = ~vif.clk;
   endtask
endclass
#+END_SRC

Correct example
#+BEGIN_SRC verilog
interface clk_if();
logic clk
time delay;
initial begin
   clk = 0;
   forever #delay clk = ~clk;
end
endinterface

class clk_ctrl;
   task clk_t(time delay);
      vif.delay = delay;
   endtask
endclass
#+END_SRC
*** Do not use *define* in test-bench              :testbench:Macro:define:
Benifits: No need to re-compile source code.
#+BEGIN_SRC verilog
initial begin
`ifdef DEF1
task_a();
`else
task_b();
`endif
end
#+END_SRC

#+BEGIN_SRC verilog
initial begin
  if ($test$plusargs("DEF1="))
     $value$plusargs("DEF1=%s",DEF1);
  case (DEF1)
    "DEF1" : task_a();
    default : task_b();
  endcase
end
#+END_SRC
*** predefined macro in system verilog                          :FILE:LINE:
predefined macro for debugging. `__FILE__ `__LINE__.
** simulation directory structure
*** tree
st
+-- rm
+-- software
    +-- submodule1
+-- tb
+-- tc
    +-- submodule1
+-- sim
    +-- makefile1
    +-- submode1
       +-- cover
       +-- logs
       +-- output
       +-- run
       +-- wave
*** makefile1

** FSDB division
*** By size
#+BEGIN_SRC tcl
fsdbAutoSwitch 1000 merge.fsdb 0
#1000 MB per fsdb , basic name merge.fsdb, how many fsdbs (0 means no limit)
dump -file merge.fsdb -type fsdb -msv on
dump -add / -fid FSDB0
run
#+END_SRC
*** by time
#+BEGIN_SRC tcl
set interval 1; #save for each interval time
set n 11      ; #how many time to save
set keep 5    ; #how many save point to keep
run 1ps
dump -close

dump -file merge_0.fsdb -type fsdb -msv on
dump -add / -fid FSDB0
run $(interval) us

for {set i 1} {$i < ${n}} {incr i} {
    set  j [expr $i -${keep}]
    dump -switch merge_${i}.fsdb -fid FSDB0
    run ${interval} us
    exec rm -rf merge_$j.fsdb
}
#+END_SRC
** AMS
*** verilog-ams
[[w3m:https://verilogams.com/][verilog-AMS document]]
