collection/collection.html

<div id="outline-container-orgacf3eb9" class="outline-4">
<h4 id="orgacf3eb9"><span class="section-number-4">3.1.4</span> Use macro as string.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="String">String</span>&#xa0;<span class="Macro">Macro</span></span></h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #94BFF3;">`define</span> FLASh_HEX  ../../st/software/code.dua
<span style="color: #7CB8BB;">#`</span> <span style="color: #F0DFAF; font-weight: bold;">$readmemh</span><span style="color: #DCDCCC;">(</span>`<span style="color: #CC9393;">"`FLASH_HEX`"</span>,CodeTmp<span style="color: #DCDCCC;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd723dc" class="outline-4">
<h4 id="orgdd723dc"><span class="section-number-4">3.1.5</span> critical signal control should be inside interface. Do not control clk in class with virtual interface.</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Clock edge may not be sample correctly for register. Recommanded clock is in inside <i>module</i>.
</p>

<p>
False example
</p>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">class</span> clk_ctrl;
   <span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">clk_t</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">time</span> delay<span style="color: #DCDCCC;">)</span>;
      <span style="color: #F0DFAF; font-weight: bold;">forever</span><span style="color: #7CB8BB;"> #delay</span> vif.clk = ~vif.clk;
   <span style="color: #F0DFAF; font-weight: bold;">endtask</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>

<p>
Correct example
</p>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">interface</span> <span style="color: #93E0E3;">clk_if</span><span style="color: #DCDCCC;">()</span>;
<span style="color: #7CB8BB;">logic</span> clk
<span style="color: #7CB8BB;">time</span> delay;
<span style="color: #F0DFAF; font-weight: bold;">initial</span> <span style="color: #7CB8BB;">begin</span>
   clk = <span style="color: #BFEBBF;">0</span>;
   <span style="color: #F0DFAF; font-weight: bold;">forever</span><span style="color: #7CB8BB;"> #delay</span> clk = ~clk;
<span style="color: #7CB8BB;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">endinterface</span>

<span style="color: #F0DFAF; font-weight: bold;">class</span> clk_ctrl;
   <span style="color: #F0DFAF; font-weight: bold;">task</span> <span style="color: #93E0E3;">clk_t</span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">time</span> delay<span style="color: #DCDCCC;">)</span>;
      vif.delay = delay;
   <span style="color: #F0DFAF; font-weight: bold;">endtask</span>
<span style="color: #F0DFAF; font-weight: bold;">endclass</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org08b2d6b" class="outline-4">
<h4 id="org08b2d6b"><span class="section-number-4">3.1.6</span> Do not use <b>define</b> in test-bench&#xa0;&#xa0;&#xa0;<span class="tag"><span class="testbench">testbench</span>&#xa0;<span class="Macro">Macro</span>&#xa0;<span class="define">define</span></span></h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
Benifits: No need to re-compile source code.
</p>
<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">initial</span> <span style="color: #7CB8BB;">begin</span>
<span style="color: #94BFF3;">`ifdef</span> DEF1
<span style="color: #93E0E3;">task_a</span><span style="color: #DCDCCC;">()</span>;
<span style="color: #94BFF3;">`else</span>
<span style="color: #93E0E3;">task_b</span><span style="color: #DCDCCC;">()</span>;
<span style="color: #94BFF3;">`endif</span>
<span style="color: #7CB8BB;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-verilog"><span style="color: #F0DFAF; font-weight: bold;">initial</span> <span style="color: #7CB8BB;">begin</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">$test$plusargs</span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"DEF1="</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
     <span style="color: #F0DFAF; font-weight: bold;">$value$plusargs</span><span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"DEF1=%s"</span>,DEF1<span style="color: #DCDCCC;">)</span>;
  <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #DCDCCC;">(</span>DEF1<span style="color: #DCDCCC;">)</span>
    <span style="color: #CC9393;">"DEF1"</span> : <span style="color: #93E0E3;">task_a</span><span style="color: #DCDCCC;">()</span>;
    <span style="color: #F0DFAF; font-weight: bold;">default</span> : <span style="color: #93E0E3;">task_b</span><span style="color: #DCDCCC;">()</span>;
  <span style="color: #F0DFAF; font-weight: bold;">endcase</span>
<span style="color: #7CB8BB;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1711452" class="outline-4">
<h4 id="org1711452"><span class="section-number-4">3.1.7</span> predefined macro in system verilog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FILE">FILE</span>&#xa0;<span class="LINE">LINE</span></span></h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
predefined macro for debugging. `__FILE__ `__LINE__.
</p>
</div>
</div>
</div>
<div id="outline-container-orged29ac8" class="outline-3">
<h3 id="orged29ac8"><span class="section-number-3">3.2</span> simulation directory structure</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org24c17ff" class="outline-4">
<h4 id="org24c17ff"><span class="section-number-4">3.2.1</span> tree</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
st
+&#x2013; rm
+&#x2013; software
    +&#x2013; submodule1
+&#x2013; tb
+&#x2013; tc
    +&#x2013; submodule1
+&#x2013; sim
    +&#x2013; makefile1
    +&#x2013; submode1
       +&#x2013; cover
       +&#x2013; logs
       +&#x2013; output
       +&#x2013; run
       +&#x2013; wave
</p>
</div>
</div>
<div id="outline-container-orgb44f103" class="outline-4">
<h4 id="orgb44f103"><span class="section-number-4">3.2.2</span> makefile1</h4>
</div>
</div>

<div id="outline-container-org3eb85f3" class="outline-3">
<h3 id="org3eb85f3"><span class="section-number-3">3.3</span> FSDB division</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgd0ef512" class="outline-4">
<h4 id="orgd0ef512"><span class="section-number-4">3.3.1</span> By size</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-tcl">fsdbAutoSwitch <span style="color: #BFEBBF;">1000</span> merge.fsdb <span style="color: #BFEBBF;">0</span>
<span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">1000 MB per fsdb , basic name merge.fsdb, how many fsdbs (0 means no limit)</span>
dump -file merge.fsdb -type fsdb -msv on
dump -add / -fid FSDB0
run
</pre>
</div>
</div>
</div>
<div id="outline-container-org9612714" class="outline-4">
<h4 id="org9612714"><span class="section-number-4">3.3.2</span> by time</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-tcl"><span style="color: #DCDCCC; font-weight: bold;">set</span> <span style="color: #DFAF8F;">interval</span> <span style="color: #BFEBBF;">1</span>; <span style="color: #7F9F7F;">#save for each interval time</span>
<span style="color: #DCDCCC; font-weight: bold;">set</span> <span style="color: #DFAF8F;">n</span> <span style="color: #BFEBBF;">11</span>      ; <span style="color: #7F9F7F;">#how many time to save</span>
<span style="color: #DCDCCC; font-weight: bold;">set</span> <span style="color: #DFAF8F;">keep</span> <span style="color: #BFEBBF;">5</span>    ; <span style="color: #7F9F7F;">#how many save point to keep</span>
run <span style="color: #BFEBBF;">1ps</span>
dump -close

dump -file merge_0.fsdb -type fsdb -msv on
dump -add / -fid FSDB0
run $<span style="color: #DCDCCC;">(</span>interval<span style="color: #DCDCCC;">)</span> us

<span style="color: #F0DFAF; font-weight: bold;">for</span> <span style="color: #DCDCCC;">{</span><span style="color: #DCDCCC; font-weight: bold;">set</span> i <span style="color: #BFEBBF;">1</span><span style="color: #DCDCCC;">}</span> <span style="color: #DCDCCC;">{</span>$<span style="color: #DFAF8F;">i</span> &lt; $<span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">n</span><span style="color: #BFEBBF;">}</span><span style="color: #DCDCCC;">}</span> <span style="color: #DCDCCC;">{</span><span style="color: #DCDCCC; font-weight: bold;">incr</span> i<span style="color: #DCDCCC;">}</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #DCDCCC; font-weight: bold;">set</span>  <span style="color: #DFAF8F;">j</span> <span style="color: #BFEBBF;">[</span><span style="color: #DCDCCC; font-weight: bold;">expr</span> $<span style="color: #DFAF8F;">i</span> -$<span style="color: #D0BF8F;">{</span><span style="color: #DFAF8F;">keep</span><span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">]</span>
    dump -switch merge_$<span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">i</span><span style="color: #BFEBBF;">}</span>.fsdb -fid FSDB0
    run $<span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">interval</span><span style="color: #BFEBBF;">}</span> us
    <span style="color: #DCDCCC; font-weight: bold;">exec</span> rm -rf merge_$<span style="color: #DFAF8F;">j</span>.fsdb
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb74ab9c" class="outline-3">
<h3 id="orgb74ab9c"><span class="section-number-3">3.4</span> AMS</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orgfd6034f" class="outline-4">
<h4 id="orgfd6034f"><span class="section-number-4">3.4.1</span> verilog-ams</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
<a href="https://verilogams.com/">verilog-AMS document</a>
</p>
</div>
</div>
