collection/collection.org
*** mix signals
Question:

How to generate merged FSDB file in a mixed-signal simulation (Cosim –VCS-XA/Finesim)?

Answer:

Merged FSDB is supported in the VCS AMS and FineSim/ Cosim tools.

Generating Merged FSDB

You can use this method to generate a unified FSDB output file that contains both analog and digital waveforms.

Note:

The CustomSim and FineSim tools support a merged FSDB file with FSDB version 5.4 or later only.

To generate a merged FSDB file, perform the following steps:

Use these commands to generate FSDB output from VCS
    Using the UCLI approach :

    ucli%dump –file vcsAms.fsdb –type fsdb -msv

   Usage of -msv is mandatory.

The CustomSim and FineSim tools must be instructed to merge their FSDB output with the digital FSDB file.
Use the following commands to merge a FSDB file containing both analog and digital signals:

For the CustomSim tool:

Use the set_waveform_option –format fsdb –file merge configuration command.

For the FineSim tool:

Use the .option finesim_output=fsdb and .option finesim_merge_fsdb=1 commands.

Run the VCS tool with the debug switch as an elaboration switch. 
After simulation, only one FSDB file would be available that contains both digital and analog signals.

The attached [[file:XA_EXAMPLE.zip][EXAMPLE.zip]] provides the demo on this usage. Use ./run_ucli to compile , simulate, and 
invoke Verdi with generated FSDB. You can select Get signals to see both digital and analog signals.

#+BEGIN_SRC verilog
task test_file_line(string filename="", int line=0);
`uvm_info("Debug",$sformat("%m,%s,%d",filename,line),UVM_NONE)
uvm_report_info("DEBUG",$sformat("%m"),UVM_MEDIUM,filename,line,)
end
test_file_line(`uvm_file,`uvm_line);
uvm_report_info()
#+END_SRC
* emacs
** \n \t \m
Horizontal Tab	HT	9	\t	^I	【Ctrl+q Ctrl+i】
Line Feed	LF	10	\n	^J	【Ctrl+q Ctrl+j】
Carriage Return	CR	13	\r	^M	【Ctrl+q Ctrl+m】

http://ergoemacs.org/emacs/emacs_line_ending_char.html
** REGEX
 Align declaration " *[0-9a-zA-Z_]+ *;"
** gtags
Jump to tags for verilog
1) exubrent ctags
2) gnu global
   install with :  --with-ctags=/path/to/ctags
   add env valuable: GTAGSLABEL=pygements
3) Instal pygements
   no root : pip install pygements____name.whl --user
   #+BEGIN_SRC 
   cp /path/to/global/share/gtags/gtags.conf ~/.globalrc
   #+END_SRC
   inside .globalrc
   #+BEGIN_SRC text
   default:\
           :tc=pygements:tc=native:
   #+END_SRC
5) spacemacs gtags layer
** ORG mode
*** disabled /_/  /^/
#+BEGIN_SRC org
#+OPTIONS: ^:nil
#+END_SRC
#+BEGIN_SRC lisp
(setq-default org-use-sub-superscripts nil)
#+END_SRC
*** 
* shell
** value test in cshell
To plan for the case where a variable, say $var, may not be defined, it gets tricky:
#+BEGIN_SRC shell
if (! $?var) then       
  echo "variable is undefined"
else
  if ("$var" == "")  then
      echo "variable is empty"
  else 
      echo "variable contains $var"
  endif
#+END_SRC

The nested ifs are required to avoid breaking the script, as tcsh 
apparently doesn't short-circuit (an else if branch's conditional will get evaluated 
even if the if branch is entered; similarly, both sides of && and || expressions
are seemingly always evaluated - this applies at least with respect to use of undefined variables).
** multi-thread
*** xargs
#+BEGIN_SRC shell
cat CmdList | xargs -P max-procs -l 1 -I {} run_sim.sh {}
#+END_SRC
*** gnu parallel
