collection/collection.html
<div id="outline-container-org9ebcb31" class="outline-4">
<h4 id="org9ebcb31"><span class="section-number-4">3.4.2</span> mix signals</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Question:
</p>

<p>
How to generate merged FSDB file in a mixed-signal simulation (Cosim –VCS-XA/Finesim)?
</p>

<p>
Answer:
</p>

<p>
Merged FSDB is supported in the VCS AMS and FineSim/ Cosim tools.
</p>

<p>
Generating Merged FSDB
</p>

<p>
You can use this method to generate a unified FSDB output file that contains both analog and digital waveforms.
</p>

<p>
Note:
</p>

<p>
The CustomSim and FineSim tools support a merged FSDB file with FSDB version 5.4 or later only.
</p>

<p>
To generate a merged FSDB file, perform the following steps:
</p>

<p>
Use these commands to generate FSDB output from VCS
    Using the UCLI approach :
</p>

<p>
ucli%dump –file vcsAms.fsdb –type fsdb -msv
</p>

<p>
Usage of -msv is mandatory.
</p>

<p>
The CustomSim and FineSim tools must be instructed to merge their FSDB output with the digital FSDB file.
Use the following commands to merge a FSDB file containing both analog and digital signals:
</p>

<p>
For the CustomSim tool:
</p>

<p>
Use the set_waveform_option –format fsdb –file merge configuration command.
</p>

<p>
For the FineSim tool:
</p>

<p>
Use the .option finesim_output=fsdb and .option finesim_merge_fsdb=1 commands.
</p>

<p>
Run the VCS tool with the debug switch as an elaboration switch. 
After simulation, only one FSDB file would be available that contains both digital and analog signals.
</p>

<p>
The attached <a href="XA_EXAMPLE.zip">EXAMPLE.zip</a> provides the demo on this usage. Use ./run_ucli to compile , simulate, and 
invoke Verdi with generated FSDB. You can select Get signals to see both digital and analog signals.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd47e191" class="outline-2">
<h2 id="orgd47e191"><span class="section-number-2">4</span> emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8382674" class="outline-3">
<h3 id="org8382674"><span class="section-number-3">4.1</span> \n \t \m</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Horizontal Tab	HT	9	\t ^I	【Ctrl+q Ctrl+i】
Line Feed	LF	10	\n ^J	【Ctrl+q Ctrl+j】
Carriage Return	CR	13	\r ^M	【Ctrl+q Ctrl+m】
</p>

<p>
<a href="http://ergoemacs.org/emacs/emacs_line_ending_char.html">http://ergoemacs.org/emacs/emacs_line_ending_char.html</a>
</p>
</div>
</div>
<div id="outline-container-org4a18f3a" class="outline-3">
<h3 id="org4a18f3a"><span class="section-number-3">4.2</span> REGEX</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Align declaration " *[0-9a-zA-Z_]+ *;"
</p>
</div>
</div>
<div id="outline-container-orgba02cf3" class="outline-3">
<h3 id="orgba02cf3"><span class="section-number-3">4.3</span> gtags</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Jump to tags for verilog
</p>
<ol class="org-ol">
<li>exubrent ctags</li>
<li>gnu global
install with :  &#x2013;with-ctags=/path/to/ctags
add env valuable: GTAGSLABEL=pygements</li>
<li><p>
Instal pygements
no root : pip install pygements____name.whl &#x2013;user
</p>
<pre class="example">
cp /path/to/global/share/gtags/gtags.conf ~/.globalrc
</pre>
<p>
inside .globalrc
</p>
<div class="org-src-container">
<pre class="src src-text">default:\
        :tc=pygements:tc=native:
</pre>
</div></li>
<li>spacemacs gtags layer</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgdb0517f" class="outline-2">
<h2 id="orgdb0517f"><span class="section-number-2">5</span> shell</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org8d9b9c6" class="outline-3">
<h3 id="org8d9b9c6"><span class="section-number-3">5.1</span> value test in cshell</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To plan for the case where a variable, say $var, may not be defined, it gets tricky:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">!</span> $<span style="color: #DFAF8F;">?</span>var<span style="color: #DCDCCC;">)</span> <span style="color: #F0DFAF; font-weight: bold;">then</span>       
  <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"variable is undefined"</span>
<span style="color: #F0DFAF; font-weight: bold;">else</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">"$var"</span> == <span style="color: #CC9393;">""</span><span style="color: #DCDCCC;">)</span>  <span style="color: #F0DFAF; font-weight: bold;">then</span>
      <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"variable is empty"</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> 
      <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"variable contains $var"</span>
  endif
</pre>
</div>

<p>
The nested ifs are required to avoid breaking the script, as tcsh 
apparently doesn't short-circuit (an else if branch's conditional will get evaluated 
even if the if branch is entered; similarly, both sides of &amp;&amp; and || expressions
are seemingly always evaluated - this applies at least with respect to use of undefined variables).
</p>
</div>
</div>
<div id="outline-container-org12b3400" class="outline-3">
<h3 id="org12b3400"><span class="section-number-3">5.2</span> multi-thread</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org88536f6" class="outline-4">
<h4 id="org88536f6"><span class="section-number-4">5.2.1</span> xargs</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-shell">cat CmdList | xargs -P max-procs -l <span style="color: #BFEBBF;">1</span> -I <span style="color: #DCDCCC;">{}</span> run_sim.sh <span style="color: #DCDCCC;">{}</span>
</pre>
</div>
</div>
</div>
