collection/collection.html
<div id="outline-container-org20b007c" class="outline-4">
<h4 id="org20b007c"><span class="section-number-4">5.2.2</span> gnu parallel</h4>
</div>
<div id="outline-container-org8aac712" class="outline-4">
<h4 id="org8aac712"><span class="section-number-4">5.2.3</span> shell script</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
<a href="https://jerkwin.github.io/2013/12/14/Bash%E8%84%9A%E6%9C%AC%E5%AE%9E%E7%8E%B0%E6%89%B9%E9%87%8F%E4%BD%9C%E4%B8%9A%E5%B9%B6%E8%A1%8C%E5%8C%96/">multi-thread blog</a>
</p>

<p>
<a href="http://blog.sciencenet.cn/blog-548663-750136.html">multi-thread blog2</a>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">!/bin/</span><span style="color: #F0DFAF; font-weight: bold;">bash</span>
<span style="color: #DFAF8F;">fifo</span>=<span style="color: #CC9393;">"/tmp/$$.fifo"</span>  <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#24314;&#31435;&#31649;&#36947;$$&#34920;&#31034;shell&#20998;&#37197;&#30340;&#36827;&#31243;&#21495;</span>
mkfifo $<span style="color: #DFAF8F;">fifo</span>
<span style="color: #F0DFAF; font-weight: bold;">exec</span> <span style="color: #BFEBBF;">6</span>&lt;&gt;$<span style="color: #DFAF8F;">fifo</span>        <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#23558;fifo&#30340;fd&#19982;6&#21495;fd&#32465;&#23450;</span>
<span style="color: #DFAF8F;">thread_num</span>=<span style="color: #BFEBBF;">8</span>         <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#21551;&#21160;&#30340;&#36827;&#31243;&#20010;&#25968;</span>
<span style="color: #DFAF8F;">count</span>=<span style="color: #BFEBBF;">0</span>;
<span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#39044;&#20998;&#37197;&#36164;&#28304;</span>
<span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #DCDCCC;">[</span><span style="color: #BFEBBF;">[</span> $<span style="color: #DFAF8F;">count</span> -lt $<span style="color: #DFAF8F;">thread_num</span> <span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">]</span>; <span style="color: #F0DFAF; font-weight: bold;">do</span>
  <span style="color: #DCDCCC; font-weight: bold;">echo</span> &gt;&amp;<span style="color: #BFEBBF;">6</span>
  <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">let count=count+1</span>
  <span style="color: #DFAF8F;">count</span>=$<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span>count + <span style="color: #BFEBBF;">1</span> <span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #F0DFAF; font-weight: bold;">done</span>
<span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#20219;&#21153;&#21015;&#34920;</span>
<span style="color: #DFAF8F;">file_list</span>=$<span style="color: #BFEBBF;">1</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> file<span style="color: #F0DFAF; font-weight: bold;"> in</span> $<span style="color: #DFAF8F;">file_list</span>
<span style="color: #F0DFAF; font-weight: bold;">do</span>
  <span style="color: #DCDCCC; font-weight: bold;">read</span> -u6       <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#35831;&#27714;&#19968;&#20010;&#36164;&#28304;</span>
  <span style="color: #DCDCCC;">{</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Task Begin"</span>
    sleep <span style="color: #BFEBBF;">1</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> $<span style="color: #DFAF8F;">file</span>   <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#20219;&#21153;</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Task End"</span>
    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">produce a cook</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> &gt;&amp;<span style="color: #BFEBBF;">6</span>     <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#23436;&#25104;&#20219;&#21153;&#65292;&#37322;&#25918;&#19968;&#20010;&#36164;&#28304;</span>
  <span style="color: #DCDCCC;">}</span>&amp;             <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#21518;&#21488;&#25191;&#34892;</span>
<span style="color: #F0DFAF; font-weight: bold;">done</span>
<span style="color: #DCDCCC; font-weight: bold;">wait</span>             <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#31561;&#24453;&#25152;&#26377;&#30340;&#20219;&#21153;&#23436;&#25104;</span>
<span style="color: #F0DFAF; font-weight: bold;">exec</span> <span style="color: #BFEBBF;">6</span>&gt;&amp;-        <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">&#20851;&#38381;fd 6&#25551;&#36848;&#31526;</span>
rm $<span style="color: #DFAF8F;">fifo</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #DFAF8F;">Njob</span>=<span style="color: #BFEBBF;">10</span>    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20316;&#19994;&#25968;&#30446;</span>
<span style="color: #DFAF8F;">Nproc</span>=<span style="color: #BFEBBF;">5</span>    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21487;&#21516;&#26102;&#36816;&#34892;&#30340;&#26368;&#22823;&#20316;&#19994;&#25968;</span>

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">CMD</span> <span style="color: #DCDCCC;">{</span>        <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#27979;&#35797;&#21629;&#20196;, &#38543;&#26426;&#31561;&#24453;&#20960;&#31186;&#38047;</span>
  <span style="color: #DFAF8F;">n</span>=$<span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span>RANDOM % <span style="color: #BFEBBF;">5</span> + <span style="color: #BFEBBF;">1</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Job $1 Ijob $2 sleeping for $n seconds ..."</span>
  sleep $<span style="color: #DFAF8F;">n</span>
  <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Job $1 Ijob $2 exiting ..."</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #DFAF8F;">Pfifo</span>=<span style="color: #CC9393;">"/tmp/$$.fifo"</span>   <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20197;PID&#20026;&#21517;, &#38450;&#27490;&#21019;&#24314;&#21629;&#21517;&#31649;&#36947;&#26102;&#19982;&#24050;&#26377;&#25991;&#20214;&#37325;&#21517;&#65292;&#20174;&#32780;&#22833;&#36133;</span>
mkfifo $<span style="color: #DFAF8F;">Pfifo</span>          <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21019;&#24314;&#21629;&#21517;&#31649;&#36947;</span>
<span style="color: #F0DFAF; font-weight: bold;">exec</span> <span style="color: #BFEBBF;">6</span>&lt;&gt;$<span style="color: #DFAF8F;">Pfifo</span>         <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20197;&#35835;&#20889;&#26041;&#24335;&#25171;&#24320;&#21629;&#21517;&#31649;&#36947;, &#25991;&#20214;&#26631;&#35782;&#31526;fd&#20026;6</span>
                       <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">fd&#21487;&#21462;&#38500;0, 1, 2,5&#22806;0-9&#20013;&#30340;&#20219;&#24847;&#25968;&#23383;</span>
rm -f $<span style="color: #DFAF8F;">Pfifo</span>           <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21024;&#38500;&#25991;&#20214;, &#20063;&#21487;&#19981;&#21024;&#38500;, &#19981;&#24433;&#21709;&#21518;&#38754;&#25805;&#20316;</span>

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#22312;fd6&#20013;&#25918;&#32622;$Nproc&#20010;&#31354;&#34892;&#20316;&#20026;&#20196;&#29260;</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span><span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #DFAF8F;">i</span>=<span style="color: #BFEBBF;">1</span>; i&lt;=$<span style="color: #DFAF8F;">Nproc</span>; i++<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>; <span style="color: #F0DFAF; font-weight: bold;">do</span>
  <span style="color: #DCDCCC; font-weight: bold;">echo</span>
<span style="color: #F0DFAF; font-weight: bold;">done</span> &gt;&amp;<span style="color: #BFEBBF;">6</span>

<span style="color: #F0DFAF; font-weight: bold;">for</span><span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #DFAF8F;">i</span>=<span style="color: #BFEBBF;">1</span>; i&lt;=$<span style="color: #DFAF8F;">Njob</span>; i++<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>; <span style="color: #F0DFAF; font-weight: bold;">do</span>  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20381;&#27425;&#25552;&#20132;&#20316;&#19994;</span>
  <span style="color: #DCDCCC; font-weight: bold;">read</span> -u6                   <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#39046;&#21462;&#20196;&#29260;, &#21363;&#20174;fd6&#20013;&#35835;&#21462;&#34892;, &#27599;&#27425;&#19968;&#34892;</span>
                               <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#23545;&#31649;&#36947;&#65292;&#35835;&#19968;&#34892;&#20415;&#23569;&#19968;&#34892;&#65292;&#27599;&#27425;&#21482;&#33021;&#35835;&#21462;&#19968;&#34892;</span>
                               <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#25152;&#26377;&#34892;&#35835;&#21462;&#23436;&#27605;, &#25191;&#34892;&#25346;&#36215;, &#30452;&#21040;&#31649;&#36947;&#20877;&#27425;&#26377;&#21487;&#35835;&#34892;</span>
                               <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#22240;&#27492;&#23454;&#29616;&#20102;&#36827;&#31243;&#25968;&#37327;&#25511;&#21046;</span>
  <span style="color: #DCDCCC;">{</span>                          <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#35201;&#25209;&#37327;&#25191;&#34892;&#30340;&#21629;&#20196;&#25918;&#22312;&#22823;&#25324;&#21495;&#20869;, &#21518;&#21488;&#36816;&#34892;</span>
    CMD $<span style="color: #DFAF8F;">i</span> &amp;&amp; <span style="color: #BFEBBF;">{</span>            <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21487;&#20351;&#29992;&#21028;&#26029;&#23376;&#36827;&#31243;&#25104;&#21151;&#19982;&#21542;&#30340;&#35821;&#21477;</span>
      <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Job $i finished"</span>
    <span style="color: #BFEBBF;">}</span> || <span style="color: #BFEBBF;">{</span>
      <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Job $i error"</span>
    <span style="color: #BFEBBF;">}</span>
    sleep <span style="color: #BFEBBF;">1</span>     <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#26242;&#20572;1&#31186;&#65292;&#21487;&#26681;&#25454;&#38656;&#35201;&#36866;&#24403;&#24310;&#38271;,</span>
                    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#20851;&#38190;&#28857;&#65292;&#32473;&#31995;&#32479;&#32531;&#20914;&#26102;&#38388;&#65292;&#36798;&#21040;&#38480;&#21046;&#24182;&#34892;&#36827;&#31243;&#25968;&#37327;&#30340;&#20316;&#29992;</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> &gt;&amp;<span style="color: #BFEBBF;">6</span>    <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#24402;&#36824;&#20196;&#29260;, &#21363;&#36827;&#31243;&#32467;&#26463;&#21518;&#65292;&#20877;&#20889;&#20837;&#19968;&#34892;&#65292;&#20351;&#25346;&#36215;&#30340;&#24490;&#29615;&#32487;&#32493;&#25191;&#34892;</span>
  <span style="color: #DCDCCC;">}</span> &amp;

<span style="color: #F0DFAF; font-weight: bold;">done</span>

<span style="color: #DCDCCC; font-weight: bold;">wait</span>                <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#31561;&#24453;&#25152;&#26377;&#30340;&#21518;&#21488;&#23376;&#36827;&#31243;&#32467;&#26463;</span>
<span style="color: #F0DFAF; font-weight: bold;">exec</span> <span style="color: #BFEBBF;">6</span>&gt;&amp;-           <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">&#21024;&#38500;&#25991;&#20214;&#26631;&#35782;&#31526;</span>
</pre>
</div>
</div>
</div>
</div>
