collection/collection.org
** valuable export
To use sub-script valuable. 
#+BEGIN_SRC shell
# in main script
source sub-script.sh
#+END_SRC
To use sub_script valuable in other sub-script
#+BEGIN_SRC shell
# in sub script
export valuable=xxx
# in main script
source sub-script.sh
#+END_SRC
** LSF
maximum nodes is 6.
#+BEGIN_SRC shell
bsub -n (node number) -np (threads per nodes) -q (queue) -o (stdout file) -e (stderr file) CMD
bqueues (queue name)
lshosts
lsload
bhosts
bacct
bjobs -l (pid) # jobs status
bjobs -p (pid) # check pending reason
#+END_SRC
** sed
#+BEGIN_SRC shell
sed -i 's/$/&TAIL/g' file.txt
sed -i 's/$/TAIL&/g' file.txt
sed -i 's/^/HEAD&/g' file.txt
#+END_SRC
match line to end
#+BEGIN_SRC shell
sed '/^abc/,$/p' x.txt
#+END_SRC
** xargs                                           :bash:argument:Function:
#+BEGIN_SRC shell
showword() {
  echo $1
}

export -f showword
echo This is a sample message | xargs -d' ' -t -n1 -P2 bash -c 'showword "$@"' _
#+END_SRC
* Makefile
** environment variable
Makefile用来调用各种命令做自动化构建工具非常方便。最近在写给Flask项目写Makefile时，需要设置环境变量，却遇到一些小问题。

如果是在全局设置环境变量时很容易：
#+BEGIN_SRC makefile

export FLASK_ENV=dev
export FLASK_DEBUG=1

dev:
    @echo $(FLASK_ENV)
    @echo $(FLASK_DEBUG)
#+END_SRC
运行make dev时则返回：
#+BEGIN_SRC shell
make dev
dev
1
#+END_SRC
但是如果需要在不同target下设置不同环境变量的话，这样就会有问题了。具体应该这样设置：

#+BEGIN_SRC makefile
dev:export FLASK_ENV=dev
dev:export FLASK_DEBUG=1
dev:
    @echo $(FLASK_ENV)
    @echo $(FLASK_DEBUG)


prod:export FLASK_ENV=prod
prod:export FLASK_DEBUG=0
prod:
    @echo $(FLASK_ENV)
    @echo $(FLASK_DEBUG)
#+END_SRC
这样再执行make dev和make prod时，不同的target下的环境变量就不会干扰了：

#+BEGIN_SRC shell 
make dev
dev
1
$ make prod
prod
0
#+END_SRC
* vim
#+BEGIN_SRC batch
@powershell -NoProfile -ExecutionPolicy Bypass -Command "iex ((new-object net.webclient).DownloadString('https://chocolatey.org/install.ps1'))" && SET PATH=%PATH%;%ALLUSERSPROFILE%\chocolatey\bin

choco install spf13-vim -y
#+END_SRC
