collection/collection.html

<div id="outline-container-orgccda3ad" class="outline-3">
<h3 id="orgccda3ad"><span class="section-number-3">5.3</span> timestamp</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-shell">date %s
date %s%N
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf229a0" class="outline-3">
<h3 id="orgaf229a0"><span class="section-number-3">5.4</span> valuable export</h3>
<div class="outline-text-3" id="text-5-4">
<p>
To use sub-script valuable. 
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">in main script</span>
<span style="color: #DCDCCC; font-weight: bold;">source</span> sub-script.sh
</pre>
</div>
<p>
To use sub_script valuable in other sub-script
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">in sub script</span>
<span style="color: #DCDCCC; font-weight: bold;">export</span> <span style="color: #DFAF8F;">valuable</span>=xxx
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">in main script</span>
<span style="color: #DCDCCC; font-weight: bold;">source</span> sub-script.sh
</pre>
</div>
</div>
</div>
<div id="outline-container-orge32a64e" class="outline-3">
<h3 id="orge32a64e"><span class="section-number-3">5.5</span> LSF</h3>
<div class="outline-text-3" id="text-5-5">
<p>
maximum nodes is 6.
</p>
<div class="org-src-container">
<pre class="src src-shell">bsub -n <span style="color: #DCDCCC;">(</span>node number<span style="color: #DCDCCC;">)</span> -np <span style="color: #DCDCCC;">(</span>threads per nodes<span style="color: #DCDCCC;">)</span> -q <span style="color: #DCDCCC;">(</span>queue<span style="color: #DCDCCC;">)</span> -o <span style="color: #DCDCCC;">(</span>stdout file<span style="color: #DCDCCC;">)</span> -e <span style="color: #DCDCCC;">(</span>stderr file<span style="color: #DCDCCC;">)</span> CMD
<span style="color: #93E0E3;">bqueues</span> <span style="color: #DCDCCC;">(</span>queue name<span style="color: #DCDCCC;">)</span>
lshosts
lsload
bhosts
bacct
bjobs -l <span style="color: #DCDCCC;">(</span>pid<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">jobs status</span>
bjobs -p <span style="color: #DCDCCC;">(</span>pid<span style="color: #DCDCCC;">)</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">check pending reason</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd21f349" class="outline-3">
<h3 id="orgd21f349"><span class="section-number-3">5.6</span> sed</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-shell">sed -i <span style="color: #CC9393;">'s/$/&amp;TAIL/g'</span> file.txt
sed -i <span style="color: #CC9393;">'s/$/TAIL&amp;/g'</span> file.txt
sed -i <span style="color: #CC9393;">'s/^/HEAD&amp;/g'</span> file.txt
</pre>
</div>
<p>
match line to end
</p>
<div class="org-src-container">
<pre class="src src-shell">sed <span style="color: #CC9393;">'/^abc/,$/p'</span> x.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org68c6abd" class="outline-3">
<h3 id="org68c6abd"><span class="section-number-3">5.7</span> xargs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bash">bash</span>&#xa0;<span class="argument">argument</span>&#xa0;<span class="Function">Function</span></span></h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #93E0E3;">showword</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #DCDCCC; font-weight: bold;">echo</span> $<span style="color: #BFEBBF;">1</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #DCDCCC; font-weight: bold;">export</span> -f showword
<span style="color: #DCDCCC; font-weight: bold;">echo</span> This is a sample message | xargs -d<span style="color: #CC9393;">' '</span> -t -n1 -P2 bash -c <span style="color: #CC9393;">'showword "$@"'</span> _
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdbd91ae" class="outline-2">
<h2 id="orgdbd91ae"><span class="section-number-2">6</span> vim</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-batch">@powershell -NoProfile -ExecutionPolicy Bypass -Command "iex ((new-object net.webclient).DownloadString('https://chocolatey.org/install.ps1'))" &amp;&amp; SET PATH=%PATH%;%ALLUSERSPROFILE%\chocolatey\bin

choco install spf13-vim -y
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-10-16 周二 11:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>